Revit 2027 API
ParameterTypeId.EnergyAnalysisPercentageSkylights Property
 "Target Percentage Skylights"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisPercentageSkylights { get; }
Public Shared ReadOnly Property EnergyAnalysisPercentageSkylights As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisPercentageSkylights {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisPercentageSkylights : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace